openmv/openmv/lib/mimxrt/MIMXRT1062/drivers/mimxrt_pads.h
// THIS FILE IS AUTO-GENERATED DO NOT EDIT.

/*
 * This file is part of the OpenMV project.
 *
 * Copyright (c) 2023 Ibrahim Abdelkader <iabdalkader@openmv.io>
 * Copyright (c) 2023 Kwabena W. Agyeman <kwagyeman@openmv.io>
 *
 * This work is licensed under the MIT license, see the file LICENSE for details.
 */
#ifndef __IMXRT_PADS_H__
#define __IMXRT_PADS_H__

#define MIMXRT_PAD_COUNT 149

#define EMC_00_AF_SEMC_DATA00 0x0
#define EMC_00_AF_FLEXPWM4 0x1
#define EMC_00_AF_LPSPI2 0x2
#define EMC_00_AF_XBAR1 0x3
#define EMC_00_AF_FLEXIO1 0x4
#define EMC_00_AF_GPIO 0x5

#define EMC_01_AF_SEMC_DATA01 0x0
#define EMC_01_AF_FLEXPWM4 0x1
#define EMC_01_AF_LPSPI2 0x2
#define EMC_01_AF_XBAR1 0x3
#define EMC_01_AF_FLEXIO1 0x4
#define EMC_01_AF_GPIO 0x5

#define EMC_02_AF_SEMC_DATA02 0x0
#define EMC_02_AF_FLEXPWM4 0x1
#define EMC_02_AF_LPSPI2 0x2
#define EMC_02_AF_XBAR1 0x3
#define EMC_02_AF_FLEXIO1 0x4
#define EMC_02_AF_GPIO 0x5

#define EMC_03_AF_SEMC_DATA03 0x0
#define EMC_03_AF_FLEXPWM4 0x1
#define EMC_03_AF_LPSPI2 0x2
#define EMC_03_AF_XBAR1 0x3
#define EMC_03_AF_FLEXIO1 0x4
#define EMC_03_AF_GPIO 0x5

#define EMC_04_AF_SEMC_DATA04 0x0
#define EMC_04_AF_FLEXPWM4 0x1
#define EMC_04_AF_SAI2 0x2
#define EMC_04_AF_XBAR1 0x3
#define EMC_04_AF_FLEXIO1 0x4
#define EMC_04_AF_GPIO 0x5

#define EMC_05_AF_SEMC_DATA05 0x0
#define EMC_05_AF_FLEXPWM4 0x1
#define EMC_05_AF_SAI2 0x2
#define EMC_05_AF_XBAR1 0x3
#define EMC_05_AF_FLEXIO1 0x4
#define EMC_05_AF_GPIO 0x5

#define EMC_06_AF_SEMC_DATA06 0x0
#define EMC_06_AF_FLEXPWM2 0x1
#define EMC_06_AF_SAI2 0x2
#define EMC_06_AF_XBAR1 0x3
#define EMC_06_AF_FLEXIO1 0x4
#define EMC_06_AF_GPIO 0x5

#define EMC_07_AF_SEMC_DATA07 0x0
#define EMC_07_AF_FLEXPWM2 0x1
#define EMC_07_AF_SAI2 0x2
#define EMC_07_AF_XBAR1 0x3
#define EMC_07_AF_FLEXIO1 0x4
#define EMC_07_AF_GPIO 0x5

#define EMC_08_AF_SEMC_DM00 0x0
#define EMC_08_AF_FLEXPWM2 0x1
#define EMC_08_AF_SAI2 0x2
#define EMC_08_AF_XBAR1 0x3
#define EMC_08_AF_FLEXIO1 0x4
#define EMC_08_AF_GPIO 0x5

#define EMC_09_AF_SEMC_ADDR00 0x0
#define EMC_09_AF_FLEXPWM2 0x1
#define EMC_09_AF_SAI2 0x2
#define EMC_09_AF_FLEXCAN2 0x3
#define EMC_09_AF_FLEXIO1 0x4
#define EMC_09_AF_GPIO 0x5
#define EMC_09_AF_FLEXSPI2 0x8

#define EMC_10_AF_SEMC_ADDR01 0x0
#define EMC_10_AF_FLEXPWM2 0x1
#define EMC_10_AF_SAI2 0x2
#define EMC_10_AF_FLEXCAN2 0x3
#define EMC_10_AF_FLEXIO1 0x4
#define EMC_10_AF_GPIO 0x5
#define EMC_10_AF_FLEXSPI2 0x8

#define EMC_11_AF_SEMC_ADDR02 0x0
#define EMC_11_AF_FLEXPWM2 0x1
#define EMC_11_AF_LPI2C4 0x2
#define EMC_11_AF_USDHC2 0x3
#define EMC_11_AF_FLEXIO1 0x4
#define EMC_11_AF_GPIO 0x5
#define EMC_11_AF_FLEXSPI2 0x8

#define EMC_12_AF_SEMC_ADDR03 0x0
#define EMC_12_AF_XBAR1 0x1
#define EMC_12_AF_LPI2C4 0x2
#define EMC_12_AF_USDHC1 0x3
#define EMC_12_AF_FLEXPWM1 0x4
#define EMC_12_AF_GPIO 0x5
#define EMC_12_AF_FLEXSPI2 0x8

#define EMC_13_AF_SEMC_ADDR04 0x0
#define EMC_13_AF_XBAR1 0x1
#define EMC_13_AF_LPUART3 0x2
#define EMC_13_AF_MQS 0x3
#define EMC_13_AF_FLEXPWM1 0x4
#define EMC_13_AF_GPIO 0x5
#define EMC_13_AF_FLEXSPI2 0x8

#define EMC_14_AF_SEMC_ADDR05 0x0
#define EMC_14_AF_XBAR1 0x1
#define EMC_14_AF_LPUART3 0x2
#define EMC_14_AF_MQS 0x3
#define EMC_14_AF_LPSPI2 0x4
#define EMC_14_AF_GPIO 0x5
#define EMC_14_AF_FLEXSPI2 0x8

#define EMC_15_AF_SEMC_ADDR06 0x0
#define EMC_15_AF_XBAR1 0x1
#define EMC_15_AF_LPUART3 0x2
#define EMC_15_AF_SPDIF 0x3
#define EMC_15_AF_QTIMER3 0x4
#define EMC_15_AF_GPIO 0x5
#define EMC_15_AF_FLEXSPI2 0x8

#define EMC_16_AF_SEMC_ADDR07 0x0
#define EMC_16_AF_XBAR1 0x1
#define EMC_16_AF_LPUART3 0x2
#define EMC_16_AF_SPDIF 0x3
#define EMC_16_AF_QTIMER3 0x4
#define EMC_16_AF_GPIO 0x5
#define EMC_16_AF_FLEXSPI2 0x8

#define EMC_17_AF_SEMC_ADDR08 0x0
#define EMC_17_AF_FLEXPWM4 0x1
#define EMC_17_AF_LPUART4 0x2
#define EMC_17_AF_FLEXCAN1 0x3
#define EMC_17_AF_QTIMER3 0x4
#define EMC_17_AF_GPIO 0x5

#define EMC_18_AF_SEMC_ADDR09 0x0
#define EMC_18_AF_FLEXPWM4 0x1
#define EMC_18_AF_LPUART4 0x2
#define EMC_18_AF_FLEXCAN1 0x3
#define EMC_18_AF_QTIMER3 0x4
#define EMC_18_AF_GPIO 0x5
#define EMC_18_AF_SNVS 0x6

#define EMC_19_AF_SEMC_ADDR11 0x0
#define EMC_19_AF_FLEXPWM2 0x1
#define EMC_19_AF_LPUART4 0x2
#define EMC_19_AF_ENET_RDATA01 0x3
#define EMC_19_AF_QTIMER2 0x4
#define EMC_19_AF_GPIO 0x5
#define EMC_19_AF_SNVS 0x6

#define EMC_20_AF_SEMC_ADDR12 0x0
#define EMC_20_AF_FLEXPWM2 0x1
#define EMC_20_AF_LPUART4 0x2
#define EMC_20_AF_ENET_RDATA00 0x3
#define EMC_20_AF_QTIMER2 0x4
#define EMC_20_AF_GPIO 0x5

#define EMC_21_AF_SEMC_BA0 0x0
#define EMC_21_AF_FLEXPWM3 0x1
#define EMC_21_AF_LPI2C3 0x2
#define EMC_21_AF_ENET_TDATA01 0x3
#define EMC_21_AF_QTIMER2 0x4
#define EMC_21_AF_GPIO 0x5

#define EMC_22_AF_SEMC_BA1 0x0
#define EMC_22_AF_FLEXPWM3 0x1
#define EMC_22_AF_LPI2C3 0x2
#define EMC_22_AF_ENET_TDATA00 0x3
#define EMC_22_AF_QTIMER2 0x4
#define EMC_22_AF_GPIO 0x5
#define EMC_22_AF_FLEXSPI2 0x8

#define EMC_23_AF_SEMC_ADDR10 0x0
#define EMC_23_AF_FLEXPWM1 0x1
#define EMC_23_AF_LPUART5 0x2
#define EMC_23_AF_ENET_RX_EN 0x3
#define EMC_23_AF_GPT1 0x4
#define EMC_23_AF_GPIO 0x5
#define EMC_23_AF_FLEXSPI2 0x8

#define EMC_24_AF_SEMC_CAS 0x0
#define EMC_24_AF_FLEXPWM1 0x1
#define EMC_24_AF_LPUART5 0x2
#define EMC_24_AF_ENET_TX_EN 0x3
#define EMC_24_AF_GPT1 0x4
#define EMC_24_AF_GPIO 0x5
#define EMC_24_AF_FLEXSPI2 0x8

#define EMC_25_AF_SEMC_RAS 0x0
#define EMC_25_AF_FLEXPWM1 0x1
#define EMC_25_AF_LPUART6 0x2
#define EMC_25_AF_ENET_TX_CLK 0x3
#define EMC_25_AF_ENET_REF_CLK 0x4
#define EMC_25_AF_GPIO 0x5
#define EMC_25_AF_FLEXSPI2 0x8

#define EMC_26_AF_SEMC_CLK 0x0
#define EMC_26_AF_FLEXPWM1 0x1
#define EMC_26_AF_LPUART6 0x2
#define EMC_26_AF_ENET_RX_ER 0x3
#define EMC_26_AF_FLEXIO1 0x4
#define EMC_26_AF_GPIO 0x5
#define EMC_26_AF_FLEXSPI2 0x8

#define EMC_27_AF_SEMC_CKE 0x0
#define EMC_27_AF_FLEXPWM1 0x1
#define EMC_27_AF_LPUART5 0x2
#define EMC_27_AF_LPSPI1 0x3
#define EMC_27_AF_FLEXIO1 0x4
#define EMC_27_AF_GPIO 0x5
#define EMC_27_AF_FLEXSPI2 0x8

#define EMC_28_AF_SEMC_WE 0x0
#define EMC_28_AF_FLEXPWM1 0x1
#define EMC_28_AF_LPUART5 0x2
#define EMC_28_AF_LPSPI1 0x3
#define EMC_28_AF_FLEXIO1 0x4
#define EMC_28_AF_GPIO 0x5
#define EMC_28_AF_FLEXSPI2 0x8

#define EMC_29_AF_SEMC_CS0 0x0
#define EMC_29_AF_FLEXPWM3 0x1
#define EMC_29_AF_LPUART6 0x2
#define EMC_29_AF_LPSPI1 0x3
#define EMC_29_AF_FLEXIO1 0x4
#define EMC_29_AF_GPIO 0x5
#define EMC_29_AF_FLEXSPI2 0x8

#define EMC_30_AF_SEMC_DATA08 0x0
#define EMC_30_AF_FLEXPWM3 0x1
#define EMC_30_AF_LPUART6 0x2
#define EMC_30_AF_LPSPI1 0x3
#define EMC_30_AF_CSI 0x4
#define EMC_30_AF_GPIO 0x5
#define EMC_30_AF_ENET2_TDATA00 0x8

#define EMC_31_AF_SEMC_DATA09 0x0
#define EMC_31_AF_FLEXPWM3 0x1
#define EMC_31_AF_LPUART7 0x2
#define EMC_31_AF_LPSPI1 0x3
#define EMC_31_AF_CSI 0x4
#define EMC_31_AF_GPIO 0x5
#define EMC_31_AF_ENET2_TDATA01 0x8

#define EMC_32_AF_SEMC_DATA10 0x0
#define EMC_32_AF_FLEXPWM3 0x1
#define EMC_32_AF_LPUART7 0x2
#define EMC_32_AF_CCM 0x3
#define EMC_32_AF_CSI 0x4
#define EMC_32_AF_GPIO 0x5
#define EMC_32_AF_ENET2_TX_EN 0x8

#define EMC_33_AF_SEMC_DATA11 0x0
#define EMC_33_AF_FLEXPWM3 0x1
#define EMC_33_AF_USDHC1 0x2
#define EMC_33_AF_SAI3 0x3
#define EMC_33_AF_CSI 0x4
#define EMC_33_AF_GPIO 0x5
#define EMC_33_AF_ENET2_TX_CLK 0x8
#define EMC_33_AF_ENET2_REF_CLK2 0x9

#define EMC_34_AF_SEMC_DATA12 0x0
#define EMC_34_AF_FLEXPWM3 0x1
#define EMC_34_AF_USDHC1 0x2
#define EMC_34_AF_SAI3 0x3
#define EMC_34_AF_CSI 0x4
#define EMC_34_AF_GPIO 0x5
#define EMC_34_AF_ENET2_RX_ER 0x8

