openmv/openmv/lib/mimxrt/MIMXRT1062/drivers/mimxrt_pads.h
#define EMC_35_AF_SEMC_DATA13 0x0
#define EMC_35_AF_XBAR1 0x1
#define EMC_35_AF_GPT1 0x2
#define EMC_35_AF_SAI3 0x3
#define EMC_35_AF_CSI 0x4
#define EMC_35_AF_GPIO 0x5
#define EMC_35_AF_USDHC1 0x6
#define EMC_35_AF_ENET2_RDATA00 0x8

#define EMC_36_AF_SEMC_DATA14 0x0
#define EMC_36_AF_XBAR1 0x1
#define EMC_36_AF_GPT1 0x2
#define EMC_36_AF_SAI3 0x3
#define EMC_36_AF_CSI 0x4
#define EMC_36_AF_GPIO 0x5
#define EMC_36_AF_USDHC1 0x6
#define EMC_36_AF_ENET2_RDATA01 0x8
#define EMC_36_AF_FLEXCAN3 0x9

#define EMC_37_AF_SEMC_DATA15 0x0
#define EMC_37_AF_XBAR1 0x1
#define EMC_37_AF_GPT1 0x2
#define EMC_37_AF_SAI3 0x3
#define EMC_37_AF_CSI 0x4
#define EMC_37_AF_GPIO 0x5
#define EMC_37_AF_USDHC2 0x6
#define EMC_37_AF_ENET2_RX_EN 0x8
#define EMC_37_AF_FLEXCAN3 0x9

#define EMC_38_AF_SEMC_DM01 0x0
#define EMC_38_AF_FLEXPWM1 0x1
#define EMC_38_AF_LPUART8 0x2
#define EMC_38_AF_SAI3 0x3
#define EMC_38_AF_CSI 0x4
#define EMC_38_AF_GPIO 0x5
#define EMC_38_AF_USDHC2 0x6
#define EMC_38_AF_ENET2_MDC 0x8

#define EMC_39_AF_SEMC_DQS 0x0
#define EMC_39_AF_FLEXPWM1 0x1
#define EMC_39_AF_LPUART8 0x2
#define EMC_39_AF_SAI3 0x3
#define EMC_39_AF_WDOG1 0x4
#define EMC_39_AF_GPIO 0x5
#define EMC_39_AF_USDHC2 0x6
#define EMC_39_AF_ENET2_MDIO 0x8
#define EMC_39_AF_SEMC_DQS4 0x9

#define EMC_40_AF_SEMC_RDY 0x0
#define EMC_40_AF_GPT2 0x1
#define EMC_40_AF_LPSPI1 0x2
#define EMC_40_AF_USB 0x3
#define EMC_40_AF_ENET_MDC 0x4
#define EMC_40_AF_GPIO 0x5
#define EMC_40_AF_USDHC2 0x6
#define EMC_40_AF_SEMC_CLK5 0x9

#define EMC_41_AF_SEMC_CSX00 0x0
#define EMC_41_AF_GPT2 0x1
#define EMC_41_AF_LPSPI1 0x2
#define EMC_41_AF_USB 0x3
#define EMC_41_AF_ENET_MDIO 0x4
#define EMC_41_AF_GPIO 0x5
#define EMC_41_AF_USDHC1 0x6

#define AD_B0_00_AF_FLEXPWM2 0x0
#define AD_B0_00_AF_XBAR1 0x1
#define AD_B0_00_AF_REF 0x2
#define AD_B0_00_AF_USB 0x3
#define AD_B0_00_AF_LPI2C1 0x4
#define AD_B0_00_AF_GPIO 0x5
#define AD_B0_00_AF_USDHC1 0x6
#define AD_B0_00_AF_LPSPI3 0x7

#define AD_B0_01_AF_FLEXPWM2 0x0
#define AD_B0_01_AF_XBAR1 0x1
#define AD_B0_01_AF_REF 0x2
#define AD_B0_01_AF_USB 0x3
#define AD_B0_01_AF_LPI2C1 0x4
#define AD_B0_01_AF_GPIO 0x5
#define AD_B0_01_AF_EWM 0x6
#define AD_B0_01_AF_LPSPI3 0x7

#define AD_B0_02_AF_FLEXCAN2 0x0
#define AD_B0_02_AF_XBAR1 0x1
#define AD_B0_02_AF_LPUART6 0x2
#define AD_B0_02_AF_USB 0x3
#define AD_B0_02_AF_FLEXPWM1 0x4
#define AD_B0_02_AF_GPIO 0x5
#define AD_B0_02_AF_LPI2C1 0x6
#define AD_B0_02_AF_LPSPI3 0x7

#define AD_B0_03_AF_FLEXCAN2 0x0
#define AD_B0_03_AF_XBAR1 0x1
#define AD_B0_03_AF_LPUART6 0x2
#define AD_B0_03_AF_USB 0x3
#define AD_B0_03_AF_FLEXPWM1 0x4
#define AD_B0_03_AF_GPIO 0x5
#define AD_B0_03_AF_REF 0x6
#define AD_B0_03_AF_LPSPI3 0x7

#define AD_B0_04_AF_SRC 0x0
#define AD_B0_04_AF_MQS 0x1
#define AD_B0_04_AF_ENET_TX_DATA03 0x2
#define AD_B0_04_AF_SAI2 0x3
#define AD_B0_04_AF_CSI 0x4
#define AD_B0_04_AF_GPIO 0x5
#define AD_B0_04_AF_PIT 0x6
#define AD_B0_04_AF_LPSPI3 0x7

#define AD_B0_05_AF_SRC 0x0
#define AD_B0_05_AF_MQS 0x1
#define AD_B0_05_AF_ENET_TX_DATA02 0x2
#define AD_B0_05_AF_SAI2 0x3
#define AD_B0_05_AF_CSI 0x4
#define AD_B0_05_AF_GPIO 0x5
#define AD_B0_05_AF_XBAR1 0x6
#define AD_B0_05_AF_LPSPI3 0x7

#define AD_B0_06_AF_JTAG 0x0
#define AD_B0_06_AF_GPT2 0x1
#define AD_B0_06_AF_ENET_RX_CLK 0x2
#define AD_B0_06_AF_SAI2 0x3
#define AD_B0_06_AF_CSI 0x4
#define AD_B0_06_AF_GPIO 0x5
#define AD_B0_06_AF_XBAR1 0x6
#define AD_B0_06_AF_LPSPI3 0x7

#define AD_B0_07_AF_JTAG 0x0
#define AD_B0_07_AF_GPT2 0x1
#define AD_B0_07_AF_ENET_TX_ER 0x2
#define AD_B0_07_AF_SAI2 0x3
#define AD_B0_07_AF_CSI 0x4
#define AD_B0_07_AF_GPIO 0x5
#define AD_B0_07_AF_XBAR1 0x6
#define AD_B0_07_AF_ENET_1588_EVENT3_OUT 0x7

#define AD_B0_08_AF_JTAG 0x0
#define AD_B0_08_AF_GPT2 0x1
#define AD_B0_08_AF_ENET_RX_DATA03 0x2
#define AD_B0_08_AF_SAI2 0x3
#define AD_B0_08_AF_CSI 0x4
#define AD_B0_08_AF_GPIO 0x5
#define AD_B0_08_AF_XBAR1 0x6
#define AD_B0_08_AF_ENET_1588_EVENT3_IN 0x7

#define AD_B0_09_AF_JTAG 0x0
#define AD_B0_09_AF_FLEXPWM2 0x1
#define AD_B0_09_AF_ENET_RX_DATA02 0x2
#define AD_B0_09_AF_SAI2 0x3
#define AD_B0_09_AF_CSI 0x4
#define AD_B0_09_AF_GPIO 0x5
#define AD_B0_09_AF_XBAR1 0x6
#define AD_B0_09_AF_GPT2 0x7
#define AD_B0_09_AF_SEMC_DQS4 0x9

#define AD_B0_10_AF_JTAG 0x0
#define AD_B0_10_AF_FLEXPWM1 0x1
#define AD_B0_10_AF_ENET_CRS 0x2
#define AD_B0_10_AF_SAI2 0x3
#define AD_B0_10_AF_CSI 0x4
#define AD_B0_10_AF_GPIO 0x5
#define AD_B0_10_AF_XBAR1 0x6
#define AD_B0_10_AF_ENET_1588_EVENT0_OUT 0x7
#define AD_B0_10_AF_FLEXCAN3 0x8
#define AD_B0_10_AF_ARM 0x9

#define AD_B0_11_AF_JTAG 0x0
#define AD_B0_11_AF_FLEXPWM1 0x1
#define AD_B0_11_AF_ENET_COL 0x2
#define AD_B0_11_AF_WDOG1 0x3
#define AD_B0_11_AF_CSI 0x4
#define AD_B0_11_AF_GPIO 0x5
#define AD_B0_11_AF_XBAR1 0x6
#define AD_B0_11_AF_ENET_1588_EVENT0_IN 0x7
#define AD_B0_11_AF_FLEXCAN3 0x8
#define AD_B0_11_AF_SEMC_CLK6 0x9

#define AD_B0_12_AF_LPI2C4 0x0
#define AD_B0_12_AF_CCM 0x1
#define AD_B0_12_AF_LPUART1 0x2
#define AD_B0_12_AF_WDOG2 0x3
#define AD_B0_12_AF_FLEXPWM1 0x4
#define AD_B0_12_AF_GPIO 0x5
#define AD_B0_12_AF_ENET_1588_EVENT1_OUT 0x6
#define AD_B0_12_AF_NMI 0x7

#define AD_B0_13_AF_LPI2C4 0x0
#define AD_B0_13_AF_GPT1 0x1
#define AD_B0_13_AF_LPUART1 0x2
#define AD_B0_13_AF_EWM 0x3
#define AD_B0_13_AF_FLEXPWM1 0x4
#define AD_B0_13_AF_GPIO 0x5
#define AD_B0_13_AF_ENET_1588_EVENT1_IN 0x6
#define AD_B0_13_AF_REF 0x7

#define AD_B0_14_AF_USB 0x0
#define AD_B0_14_AF_XBAR1 0x1
#define AD_B0_14_AF_LPUART1 0x2
#define AD_B0_14_AF_ENET_1588_EVENT0_OUT 0x3
#define AD_B0_14_AF_CSI 0x4
#define AD_B0_14_AF_GPIO 0x5
#define AD_B0_14_AF_FLEXCAN2 0x6
#define AD_B0_14_AF_FLEXCAN3 0x8

#define AD_B0_15_AF_USB 0x0
#define AD_B0_15_AF_XBAR1 0x1
#define AD_B0_15_AF_LPUART1 0x2
#define AD_B0_15_AF_ENET_1588_EVENT0_IN 0x3
#define AD_B0_15_AF_CSI 0x4
#define AD_B0_15_AF_GPIO 0x5
#define AD_B0_15_AF_FLEXCAN2 0x6
#define AD_B0_15_AF_WDOG1 0x7
#define AD_B0_15_AF_FLEXCAN3 0x8

#define AD_B1_00_AF_USB 0x0
#define AD_B1_00_AF_QTIMER3 0x1
#define AD_B1_00_AF_LPUART2 0x2
#define AD_B1_00_AF_LPI2C1 0x3
#define AD_B1_00_AF_WDOG1 0x4
#define AD_B1_00_AF_GPIO 0x5
#define AD_B1_00_AF_USDHC1 0x6
#define AD_B1_00_AF_KPP 0x7
#define AD_B1_00_AF_ENET2_1588_EVENT0_OUT 0x8
#define AD_B1_00_AF_FLEXIO3 0x9

#define AD_B1_01_AF_USB 0x0
#define AD_B1_01_AF_QTIMER3 0x1
#define AD_B1_01_AF_LPUART2 0x2
#define AD_B1_01_AF_LPI2C1 0x3
#define AD_B1_01_AF_CCM 0x4
#define AD_B1_01_AF_GPIO 0x5
#define AD_B1_01_AF_USDHC1 0x6
#define AD_B1_01_AF_KPP 0x7
#define AD_B1_01_AF_ENET2_1588_EVENT0_IN 0x8
#define AD_B1_01_AF_FLEXIO3 0x9

#define AD_B1_02_AF_USB 0x0
#define AD_B1_02_AF_QTIMER3 0x1
#define AD_B1_02_AF_LPUART2 0x2
#define AD_B1_02_AF_SPDIF 0x3
#define AD_B1_02_AF_ENET_1588_EVENT2_OUT 0x4
#define AD_B1_02_AF_GPIO 0x5
#define AD_B1_02_AF_USDHC1 0x6
#define AD_B1_02_AF_KPP 0x7
#define AD_B1_02_AF_GPT2 0x8
#define AD_B1_02_AF_FLEXIO3 0x9

#define AD_B1_03_AF_USB 0x0
#define AD_B1_03_AF_QTIMER3 0x1
#define AD_B1_03_AF_LPUART2 0x2
#define AD_B1_03_AF_SPDIF 0x3
#define AD_B1_03_AF_ENET_1588_EVENT2_IN 0x4
#define AD_B1_03_AF_GPIO 0x5
#define AD_B1_03_AF_USDHC2 0x6
#define AD_B1_03_AF_KPP 0x7
#define AD_B1_03_AF_GPT2 0x8
#define AD_B1_03_AF_FLEXIO3 0x9

#define AD_B1_04_AF_FLEXSPIB 0x0
#define AD_B1_04_AF_ENET_MDC 0x1
#define AD_B1_04_AF_LPUART3 0x2
#define AD_B1_04_AF_SPDIF 0x3
#define AD_B1_04_AF_CSI 0x4
#define AD_B1_04_AF_GPIO 0x5
#define AD_B1_04_AF_USDHC2 0x6
#define AD_B1_04_AF_KPP 0x7
#define AD_B1_04_AF_GPT2 0x8
#define AD_B1_04_AF_FLEXIO3 0x9

#define AD_B1_05_AF_FLEXSPIB 0x0
#define AD_B1_05_AF_ENET_MDIO 0x1
#define AD_B1_05_AF_LPUART3 0x2
#define AD_B1_05_AF_SPDIF 0x3
#define AD_B1_05_AF_CSI 0x4
#define AD_B1_05_AF_GPIO 0x5
#define AD_B1_05_AF_USDHC2 0x6
#define AD_B1_05_AF_KPP 0x7
#define AD_B1_05_AF_GPT2 0x8
#define AD_B1_05_AF_FLEXIO3 0x9

#define AD_B1_06_AF_FLEXSPIB 0x0
#define AD_B1_06_AF_LPI2C3 0x1
#define AD_B1_06_AF_LPUART3 0x2
#define AD_B1_06_AF_SPDIF 0x3
#define AD_B1_06_AF_CSI 0x4
#define AD_B1_06_AF_GPIO 0x5
#define AD_B1_06_AF_USDHC2 0x6
#define AD_B1_06_AF_KPP 0x7
#define AD_B1_06_AF_GPT2 0x8
#define AD_B1_06_AF_FLEXIO3 0x9

#define AD_B1_07_AF_FLEXSPIB 0x0
#define AD_B1_07_AF_LPI2C3 0x1
#define AD_B1_07_AF_LPUART3 0x2
#define AD_B1_07_AF_SPDIF 0x3
#define AD_B1_07_AF_CSI 0x4
#define AD_B1_07_AF_GPIO 0x5
#define AD_B1_07_AF_USDHC2 0x6
#define AD_B1_07_AF_KPP 0x7
#define AD_B1_07_AF_GPT2 0x8
#define AD_B1_07_AF_FLEXIO3 0x9

