openmv/openmv/lib/mimxrt/MIMXRT1062/drivers/mimxrt_pads.h
#define AD_B1_08_AF_FLEXSPIA 0x0
#define AD_B1_08_AF_FLEXPWM4 0x1
#define AD_B1_08_AF_FLEXCAN1 0x2
#define AD_B1_08_AF_CCM 0x3
#define AD_B1_08_AF_CSI 0x4
#define AD_B1_08_AF_GPIO 0x5
#define AD_B1_08_AF_USDHC2 0x6
#define AD_B1_08_AF_KPP 0x7
#define AD_B1_08_AF_FLEXIO3 0x9

#define AD_B1_09_AF_FLEXSPIA 0x0
#define AD_B1_09_AF_FLEXPWM4 0x1
#define AD_B1_09_AF_FLEXCAN1 0x2
#define AD_B1_09_AF_SAI1 0x3
#define AD_B1_09_AF_CSI 0x4
#define AD_B1_09_AF_GPIO 0x5
#define AD_B1_09_AF_USDHC2 0x6
#define AD_B1_09_AF_KPP 0x7
#define AD_B1_09_AF_FLEXIO3 0x9

#define AD_B1_10_AF_FLEXSPIA 0x0
#define AD_B1_10_AF_WDOG1 0x1
#define AD_B1_10_AF_LPUART8 0x2
#define AD_B1_10_AF_SAI1 0x3
#define AD_B1_10_AF_CSI 0x4
#define AD_B1_10_AF_GPIO 0x5
#define AD_B1_10_AF_USDHC2 0x6
#define AD_B1_10_AF_KPP 0x7
#define AD_B1_10_AF_ENET2_1588_EVENT1_OUT 0x8
#define AD_B1_10_AF_FLEXIO3 0x9

#define AD_B1_11_AF_FLEXSPIA 0x0
#define AD_B1_11_AF_EWM 0x1
#define AD_B1_11_AF_LPUART8 0x2
#define AD_B1_11_AF_SAI1 0x3
#define AD_B1_11_AF_CSI 0x4
#define AD_B1_11_AF_GPIO 0x5
#define AD_B1_11_AF_USDHC2 0x6
#define AD_B1_11_AF_KPP 0x7
#define AD_B1_11_AF_ENET2_1588_EVENT1_IN 0x8
#define AD_B1_11_AF_FLEXIO3 0x9

#define AD_B1_12_AF_FLEXSPIA 0x0
#define AD_B1_12_AF_ACMP 0x1
#define AD_B1_12_AF_LPSPI3 0x2
#define AD_B1_12_AF_SAI1 0x3
#define AD_B1_12_AF_CSI 0x4
#define AD_B1_12_AF_GPIO 0x5
#define AD_B1_12_AF_USDHC2 0x6
#define AD_B1_12_AF_KPP 0x7
#define AD_B1_12_AF_ENET2_1588_EVENT2_OUT 0x8
#define AD_B1_12_AF_FLEXIO3 0x9

#define AD_B1_13_AF_FLEXSPIA 0x0
#define AD_B1_13_AF_ACMP 0x1
#define AD_B1_13_AF_LPSPI3 0x2
#define AD_B1_13_AF_SAI1 0x3
#define AD_B1_13_AF_CSI 0x4
#define AD_B1_13_AF_GPIO 0x5
#define AD_B1_13_AF_USDHC2 0x6
#define AD_B1_13_AF_KPP 0x7
#define AD_B1_13_AF_ENET2_1588_EVENT2_IN 0x8
#define AD_B1_13_AF_FLEXIO3 0x9

#define AD_B1_14_AF_FLEXSPIA 0x0
#define AD_B1_14_AF_ACMP 0x1
#define AD_B1_14_AF_LPSPI3 0x2
#define AD_B1_14_AF_SAI1 0x3
#define AD_B1_14_AF_CSI 0x4
#define AD_B1_14_AF_GPIO 0x5
#define AD_B1_14_AF_USDHC2 0x6
#define AD_B1_14_AF_KPP 0x7
#define AD_B1_14_AF_ENET2_1588_EVENT3_OUT 0x8
#define AD_B1_14_AF_FLEXIO3 0x9

#define AD_B1_15_AF_FLEXSPIA 0x0
#define AD_B1_15_AF_ACMP 0x1
#define AD_B1_15_AF_LPSPI3 0x2
#define AD_B1_15_AF_SAI1 0x3
#define AD_B1_15_AF_CSI 0x4
#define AD_B1_15_AF_GPIO 0x5
#define AD_B1_15_AF_USDHC2 0x6
#define AD_B1_15_AF_KPP 0x7
#define AD_B1_15_AF_ENET2_1588_EVENT3_IN 0x8
#define AD_B1_15_AF_FLEXIO3 0x9

#define B0_00_AF_LCD 0x0
#define B0_00_AF_QTIMER1 0x1
#define B0_00_AF_MQS 0x2
#define B0_00_AF_LPSPI4 0x3
#define B0_00_AF_FLEXIO2 0x4
#define B0_00_AF_GPIO 0x5
#define B0_00_AF_SEMC_CSX01 0x6
#define B0_00_AF_ENET2_MDC 0x8

#define B0_01_AF_LCD 0x0
#define B0_01_AF_QTIMER1 0x1
#define B0_01_AF_MQS 0x2
#define B0_01_AF_LPSPI4 0x3
#define B0_01_AF_FLEXIO2 0x4
#define B0_01_AF_GPIO 0x5
#define B0_01_AF_SEMC_CSX02 0x6
#define B0_01_AF_ENET2_MDIO 0x8

#define B0_02_AF_LCD 0x0
#define B0_02_AF_QTIMER1 0x1
#define B0_02_AF_FLEXCAN1 0x2
#define B0_02_AF_LPSPI4 0x3
#define B0_02_AF_FLEXIO2 0x4
#define B0_02_AF_GPIO 0x5
#define B0_02_AF_SEMC_CSX03 0x6
#define B0_02_AF_ENET2_1588_EVENT0_OUT 0x8

#define B0_03_AF_LCD 0x0
#define B0_03_AF_QTIMER2 0x1
#define B0_03_AF_FLEXCAN1 0x2
#define B0_03_AF_LPSPI4 0x3
#define B0_03_AF_FLEXIO2 0x4
#define B0_03_AF_GPIO 0x5
#define B0_03_AF_WDOG2 0x6
#define B0_03_AF_ENET2_1588_EVENT0_IN 0x8

#define B0_04_AF_LCD 0x0
#define B0_04_AF_QTIMER2 0x1
#define B0_04_AF_LPI2C2 0x2
#define B0_04_AF_ARM 0x3
#define B0_04_AF_FLEXIO2 0x4
#define B0_04_AF_GPIO 0x5
#define B0_04_AF_SRC 0x6
#define B0_04_AF_ENET2_TDATA03 0x8

#define B0_05_AF_LCD 0x0
#define B0_05_AF_QTIMER2 0x1
#define B0_05_AF_LPI2C2 0x2
#define B0_05_AF_ARM 0x3
#define B0_05_AF_FLEXIO2 0x4
#define B0_05_AF_GPIO 0x5
#define B0_05_AF_SRC 0x6
#define B0_05_AF_ENET2_TDATA02 0x8

#define B0_06_AF_LCD 0x0
#define B0_06_AF_QTIMER3 0x1
#define B0_06_AF_FLEXPWM2 0x2
#define B0_06_AF_ARM 0x3
#define B0_06_AF_FLEXIO2 0x4
#define B0_06_AF_GPIO 0x5
#define B0_06_AF_SRC 0x6
#define B0_06_AF_ENET2_RX_CLK 0x8

#define B0_07_AF_LCD 0x0
#define B0_07_AF_QTIMER3 0x1
#define B0_07_AF_FLEXPWM2 0x2
#define B0_07_AF_ARM 0x3
#define B0_07_AF_FLEXIO2 0x4
#define B0_07_AF_GPIO 0x5
#define B0_07_AF_SRC 0x6
#define B0_07_AF_ENET2_TX_ER 0x8

#define B0_08_AF_LCD 0x0
#define B0_08_AF_QTIMER3 0x1
#define B0_08_AF_FLEXPWM2 0x2
#define B0_08_AF_LPUART3 0x3
#define B0_08_AF_FLEXIO2 0x4
#define B0_08_AF_GPIO 0x5
#define B0_08_AF_SRC 0x6
#define B0_08_AF_ENET2_RDATA03 0x8

#define B0_09_AF_LCD 0x0
#define B0_09_AF_QTIMER4 0x1
#define B0_09_AF_FLEXPWM2 0x2
#define B0_09_AF_LPUART3 0x3
#define B0_09_AF_FLEXIO2 0x4
#define B0_09_AF_GPIO 0x5
#define B0_09_AF_SRC 0x6
#define B0_09_AF_ENET2_RDATA02 0x8

#define B0_10_AF_LCD 0x0
#define B0_10_AF_QTIMER4 0x1
#define B0_10_AF_FLEXPWM2 0x2
#define B0_10_AF_SAI1 0x3
#define B0_10_AF_FLEXIO2 0x4
#define B0_10_AF_GPIO 0x5
#define B0_10_AF_SRC 0x6
#define B0_10_AF_ENET2_CRS 0x8

#define B0_11_AF_LCD 0x0
#define B0_11_AF_QTIMER4 0x1
#define B0_11_AF_FLEXPWM2 0x2
#define B0_11_AF_SAI1 0x3
#define B0_11_AF_FLEXIO2 0x4
#define B0_11_AF_GPIO 0x5
#define B0_11_AF_SRC 0x6
#define B0_11_AF_ENET2_COL 0x8

#define B0_12_AF_LCD 0x0
#define B0_12_AF_XBAR1 0x1
#define B0_12_AF_ARM 0x2
#define B0_12_AF_SAI1 0x3
#define B0_12_AF_FLEXIO2 0x4
#define B0_12_AF_GPIO 0x5
#define B0_12_AF_SRC 0x6
#define B0_12_AF_ENET2_TDATA00 0x8

#define B0_13_AF_LCD 0x0
#define B0_13_AF_XBAR1 0x1
#define B0_13_AF_ARM 0x2
#define B0_13_AF_SAI1 0x3
#define B0_13_AF_FLEXIO2 0x4
#define B0_13_AF_GPIO 0x5
#define B0_13_AF_SRC 0x6
#define B0_13_AF_ENET2_TDATA01 0x8

#define B0_14_AF_LCD 0x0
#define B0_14_AF_XBAR1 0x1
#define B0_14_AF_ARM 0x2
#define B0_14_AF_SAI1 0x3
#define B0_14_AF_FLEXIO2 0x4
#define B0_14_AF_GPIO 0x5
#define B0_14_AF_SRC 0x6
#define B0_14_AF_ENET2_TX_EN 0x8

#define B0_15_AF_LCD 0x0
#define B0_15_AF_XBAR1 0x1
#define B0_15_AF_ARM 0x2
#define B0_15_AF_SAI1 0x3
#define B0_15_AF_FLEXIO2 0x4
#define B0_15_AF_GPIO 0x5
#define B0_15_AF_SRC 0x6
#define B0_15_AF_ENET2_TX_CLK 0x8
#define B0_15_AF_ENET2_REF_CLK2 0x9

#define B1_00_AF_LCD 0x0
#define B1_00_AF_XBAR1 0x1
#define B1_00_AF_LPUART4 0x2
#define B1_00_AF_SAI1 0x3
#define B1_00_AF_FLEXIO2 0x4
#define B1_00_AF_GPIO 0x5
#define B1_00_AF_FLEXPWM1 0x6
#define B1_00_AF_ENET2_RX_ER 0x8
#define B1_00_AF_FLEXIO3 0x9

#define B1_01_AF_LCD 0x0
#define B1_01_AF_XBAR1 0x1
#define B1_01_AF_LPUART4 0x2
#define B1_01_AF_SAI1 0x3
#define B1_01_AF_FLEXIO2 0x4
#define B1_01_AF_GPIO 0x5
#define B1_01_AF_FLEXPWM1 0x6
#define B1_01_AF_ENET2_RDATA00 0x8
#define B1_01_AF_FLEXIO3 0x9

#define B1_02_AF_LCD 0x0
#define B1_02_AF_XBAR1 0x1
#define B1_02_AF_LPSPI4 0x2
#define B1_02_AF_SAI1 0x3
#define B1_02_AF_FLEXIO2 0x4
#define B1_02_AF_GPIO 0x5
#define B1_02_AF_FLEXPWM2 0x6
#define B1_02_AF_ENET2_RDATA01 0x8
#define B1_02_AF_FLEXIO3 0x9

#define B1_03_AF_LCD 0x0
#define B1_03_AF_XBAR1 0x1
#define B1_03_AF_LPSPI4 0x2
#define B1_03_AF_SAI1 0x3
#define B1_03_AF_FLEXIO2 0x4
#define B1_03_AF_GPIO 0x5
#define B1_03_AF_FLEXPWM2 0x6
#define B1_03_AF_ENET2_RX_EN 0x8
#define B1_03_AF_FLEXIO3 0x9

#define B1_04_AF_LCD 0x0
#define B1_04_AF_LPSPI4 0x1
#define B1_04_AF_CSI 0x2
#define B1_04_AF_ENET_RX_DATA00 0x3
#define B1_04_AF_FLEXIO2 0x4
#define B1_04_AF_GPIO 0x5
#define B1_04_AF_GPT1 0x8
#define B1_04_AF_FLEXIO3 0x9

#define B1_05_AF_LCD 0x0
#define B1_05_AF_LPSPI4 0x1
#define B1_05_AF_CSI 0x2
#define B1_05_AF_ENET_RX_DATA01 0x3
#define B1_05_AF_FLEXIO2 0x4
#define B1_05_AF_GPIO 0x5
#define B1_05_AF_GPT1 0x8
#define B1_05_AF_FLEXIO3 0x9

#define B1_06_AF_LCD 0x0
#define B1_06_AF_LPSPI4 0x1
#define B1_06_AF_CSI 0x2
#define B1_06_AF_ENET_RX_EN 0x3
#define B1_06_AF_FLEXIO2 0x4
#define B1_06_AF_GPIO 0x5
#define B1_06_AF_GPT1 0x8
#define B1_06_AF_FLEXIO3 0x9

#define B1_07_AF_LCD 0x0
#define B1_07_AF_LPSPI4 0x1
#define B1_07_AF_CSI 0x2
#define B1_07_AF_ENET_TX_DATA00 0x3
#define B1_07_AF_FLEXIO2 0x4
#define B1_07_AF_GPIO 0x5
#define B1_07_AF_GPT1 0x8
#define B1_07_AF_FLEXIO3 0x9

#define B1_08_AF_LCD 0x0
#define B1_08_AF_QTIMER1 0x1
#define B1_08_AF_CSI 0x2
#define B1_08_AF_ENET_TX_DATA01 0x3
#define B1_08_AF_FLEXIO2 0x4
#define B1_08_AF_GPIO 0x5
#define B1_08_AF_FLEXCAN2 0x6
#define B1_08_AF_GPT1 0x8
#define B1_08_AF_FLEXIO3 0x9

