openmv/openmv/lib/mimxrt/MIMXRT1062/drivers/mimxrt_pads.h
#define B1_09_AF_LCD 0x0
#define B1_09_AF_QTIMER2 0x1
#define B1_09_AF_CSI 0x2
#define B1_09_AF_ENET_TX_EN 0x3
#define B1_09_AF_FLEXIO2 0x4
#define B1_09_AF_GPIO 0x5
#define B1_09_AF_FLEXCAN2 0x6
#define B1_09_AF_GPT1 0x8
#define B1_09_AF_FLEXIO3 0x9

#define B1_10_AF_LCD 0x0
#define B1_10_AF_QTIMER3 0x1
#define B1_10_AF_CSI 0x2
#define B1_10_AF_ENET_TX_CLK 0x3
#define B1_10_AF_FLEXIO2 0x4
#define B1_10_AF_GPIO 0x5
#define B1_10_AF_ENET_REF_CLK 0x6
#define B1_10_AF_FLEXIO3 0x9

#define B1_11_AF_LCD 0x0
#define B1_11_AF_QTIMER4 0x1
#define B1_11_AF_CSI 0x2
#define B1_11_AF_ENET_RX_ER 0x3
#define B1_11_AF_FLEXIO2 0x4
#define B1_11_AF_GPIO 0x5
#define B1_11_AF_LPSPI4 0x6
#define B1_11_AF_FLEXIO3 0x9

#define B1_12_AF_LPUART5 0x1
#define B1_12_AF_CSI 0x2
#define B1_12_AF_ENET_1588_EVENT0_IN 0x3
#define B1_12_AF_FLEXIO2 0x4
#define B1_12_AF_GPIO 0x5
#define B1_12_AF_USDHC1 0x6
#define B1_12_AF_FLEXIO3 0x9

#define B1_13_AF_WDOG1 0x0
#define B1_13_AF_LPUART5 0x1
#define B1_13_AF_CSI 0x2
#define B1_13_AF_ENET_1588_EVENT0_OUT 0x3
#define B1_13_AF_FLEXIO2 0x4
#define B1_13_AF_GPIO 0x5
#define B1_13_AF_USDHC1 0x6
#define B1_13_AF_SEMC_DQS4 0x8
#define B1_13_AF_FLEXIO3 0x9

#define B1_14_AF_ENET_MDC 0x0
#define B1_14_AF_FLEXPWM4 0x1
#define B1_14_AF_CSI 0x2
#define B1_14_AF_XBAR1 0x3
#define B1_14_AF_FLEXIO2 0x4
#define B1_14_AF_GPIO 0x5
#define B1_14_AF_USDHC1 0x6
#define B1_14_AF_ENET2_TDATA00 0x8
#define B1_14_AF_FLEXIO3 0x9

#define B1_15_AF_ENET_MDIO 0x0
#define B1_15_AF_FLEXPWM4 0x1
#define B1_15_AF_CSI 0x2
#define B1_15_AF_XBAR1 0x3
#define B1_15_AF_FLEXIO2 0x4
#define B1_15_AF_GPIO 0x5
#define B1_15_AF_USDHC1 0x6
#define B1_15_AF_ENET2_TDATA01 0x8
#define B1_15_AF_FLEXIO3 0x9

#define SD_B0_00_AF_USDHC1 0x0
#define SD_B0_00_AF_FLEXPWM1 0x1
#define SD_B0_00_AF_LPI2C3 0x2
#define SD_B0_00_AF_XBAR1 0x3
#define SD_B0_00_AF_LPSPI1 0x4
#define SD_B0_00_AF_GPIO 0x5
#define SD_B0_00_AF_FLEXSPIA 0x6
#define SD_B0_00_AF_ENET2_TX_EN 0x8
#define SD_B0_00_AF_SEMC_DQS4 0x9

#define SD_B0_01_AF_USDHC1 0x0
#define SD_B0_01_AF_FLEXPWM1 0x1
#define SD_B0_01_AF_LPI2C3 0x2
#define SD_B0_01_AF_XBAR1 0x3
#define SD_B0_01_AF_LPSPI1 0x4
#define SD_B0_01_AF_GPIO 0x5
#define SD_B0_01_AF_FLEXSPIB 0x6
#define SD_B0_01_AF_ENET2_TX_CLK 0x8
#define SD_B0_01_AF_ENET2_REF_CLK2 0x9

#define SD_B0_02_AF_USDHC1 0x0
#define SD_B0_02_AF_FLEXPWM1 0x1
#define SD_B0_02_AF_LPUART8 0x2
#define SD_B0_02_AF_XBAR1 0x3
#define SD_B0_02_AF_LPSPI1 0x4
#define SD_B0_02_AF_GPIO 0x5
#define SD_B0_02_AF_ENET2_RX_ER 0x8
#define SD_B0_02_AF_SEMC_CLK5 0x9

#define SD_B0_03_AF_USDHC1 0x0
#define SD_B0_03_AF_FLEXPWM1 0x1
#define SD_B0_03_AF_LPUART8 0x2
#define SD_B0_03_AF_XBAR1 0x3
#define SD_B0_03_AF_LPSPI1 0x4
#define SD_B0_03_AF_GPIO 0x5
#define SD_B0_03_AF_ENET2_RDATA00 0x8
#define SD_B0_03_AF_SEMC_CLK6 0x9

#define SD_B0_04_AF_USDHC1 0x0
#define SD_B0_04_AF_FLEXPWM1 0x1
#define SD_B0_04_AF_LPUART8 0x2
#define SD_B0_04_AF_XBAR1 0x3
#define SD_B0_04_AF_FLEXSPIB 0x4
#define SD_B0_04_AF_GPIO 0x5
#define SD_B0_04_AF_CCM 0x6
#define SD_B0_04_AF_ENET2_RDATA01 0x8

#define SD_B0_05_AF_USDHC1 0x0
#define SD_B0_05_AF_FLEXPWM1 0x1
#define SD_B0_05_AF_LPUART8 0x2
#define SD_B0_05_AF_XBAR1 0x3
#define SD_B0_05_AF_FLEXSPIB 0x4
#define SD_B0_05_AF_GPIO 0x5
#define SD_B0_05_AF_CCM 0x6
#define SD_B0_05_AF_ENET2_RX_EN 0x8

#define SD_B1_00_AF_USDHC2 0x0
#define SD_B1_00_AF_FLEXSPIB 0x1
#define SD_B1_00_AF_FLEXPWM1 0x2
#define SD_B1_00_AF_SAI1 0x3
#define SD_B1_00_AF_LPUART4 0x4
#define SD_B1_00_AF_GPIO 0x5
#define SD_B1_00_AF_SAI3 0x8

#define SD_B1_01_AF_USDHC2 0x0
#define SD_B1_01_AF_FLEXSPIB 0x1
#define SD_B1_01_AF_FLEXPWM1 0x2
#define SD_B1_01_AF_SAI1 0x3
#define SD_B1_01_AF_LPUART4 0x4
#define SD_B1_01_AF_GPIO 0x5
#define SD_B1_01_AF_SAI3 0x8

#define SD_B1_02_AF_USDHC2 0x0
#define SD_B1_02_AF_FLEXSPIB 0x1
#define SD_B1_02_AF_FLEXPWM2 0x2
#define SD_B1_02_AF_SAI1 0x3
#define SD_B1_02_AF_FLEXCAN1 0x4
#define SD_B1_02_AF_GPIO 0x5
#define SD_B1_02_AF_CCM 0x6
#define SD_B1_02_AF_SAI3 0x8

#define SD_B1_03_AF_USDHC2 0x0
#define SD_B1_03_AF_FLEXSPIB 0x1
#define SD_B1_03_AF_FLEXPWM2 0x2
#define SD_B1_03_AF_SAI1 0x3
#define SD_B1_03_AF_FLEXCAN1 0x4
#define SD_B1_03_AF_GPIO 0x5
#define SD_B1_03_AF_CCM 0x6
#define SD_B1_03_AF_SAI3 0x8

#define SD_B1_04_AF_USDHC2 0x0
#define SD_B1_04_AF_FLEXSPIB 0x1
#define SD_B1_04_AF_LPI2C1 0x2
#define SD_B1_04_AF_SAI1 0x3
#define SD_B1_04_AF_FLEXSPIA 0x4
#define SD_B1_04_AF_GPIO 0x5
#define SD_B1_04_AF_CCM 0x6
#define SD_B1_04_AF_SAI3 0x8

#define SD_B1_05_AF_USDHC2 0x0
#define SD_B1_05_AF_FLEXSPIA 0x1
#define SD_B1_05_AF_LPI2C1 0x2
#define SD_B1_05_AF_SAI1 0x3
#define SD_B1_05_AF_FLEXSPIB 0x4
#define SD_B1_05_AF_GPIO 0x5
#define SD_B1_05_AF_SAI3 0x8

#define SD_B1_06_AF_USDHC2 0x0
#define SD_B1_06_AF_FLEXSPIA 0x1
#define SD_B1_06_AF_LPUART7 0x2
#define SD_B1_06_AF_SAI1 0x3
#define SD_B1_06_AF_LPSPI2 0x4
#define SD_B1_06_AF_GPIO 0x5
#define SD_B1_06_AF_SAI3 0x8

#define SD_B1_07_AF_SEMC_CSX01 0x0
#define SD_B1_07_AF_FLEXSPIA 0x1
#define SD_B1_07_AF_LPUART7 0x2
#define SD_B1_07_AF_SAI1 0x3
#define SD_B1_07_AF_LPSPI2 0x4
#define SD_B1_07_AF_GPIO 0x5

#define SD_B1_08_AF_USDHC2 0x0
#define SD_B1_08_AF_FLEXSPIA 0x1
#define SD_B1_08_AF_LPUART7 0x2
#define SD_B1_08_AF_SAI1 0x3
#define SD_B1_08_AF_LPSPI2 0x4
#define SD_B1_08_AF_GPIO 0x5
#define SD_B1_08_AF_SEMC_CSX02 0x6

#define SD_B1_09_AF_USDHC2 0x0
#define SD_B1_09_AF_FLEXSPIA 0x1
#define SD_B1_09_AF_LPUART7 0x2
#define SD_B1_09_AF_SAI1 0x3
#define SD_B1_09_AF_LPSPI2 0x4
#define SD_B1_09_AF_GPIO 0x5

#define SD_B1_10_AF_USDHC2 0x0
#define SD_B1_10_AF_FLEXSPIA 0x1
#define SD_B1_10_AF_LPUART2 0x2
#define SD_B1_10_AF_LPI2C2 0x3
#define SD_B1_10_AF_LPSPI2 0x4
#define SD_B1_10_AF_GPIO 0x5

#define SD_B1_11_AF_USDHC2 0x0
#define SD_B1_11_AF_FLEXSPIA 0x1
#define SD_B1_11_AF_LPUART2 0x2
#define SD_B1_11_AF_LPI2C2 0x3
#define SD_B1_11_AF_LPSPI2 0x4
#define SD_B1_11_AF_GPIO 0x5

#define SPI_B0_00_AF_GPIO 0x5

#define SPI_B0_01_AF_FLEXSPI2 0x0
#define SPI_B0_01_AF_GPIO 0x5

#define SPI_B0_02_AF_FLEXSPI2 0x0
#define SPI_B0_02_AF_GPIO 0x5

#define SPI_B0_03_AF_FLEXSPI2 0x0
#define SPI_B0_03_AF_GPIO 0x5

