openmv/openmv/lib/mimxrt/MIMXRT1062/drivers/mimxrt_pads.h
#define SPI_B0_04_AF_FLEXSPI2 0x0
#define SPI_B0_04_AF_GPIO 0x5

#define SPI_B0_05_AF_FLEXSPI2 0x0
#define SPI_B0_05_AF_GPIO 0x5

#define SPI_B0_06_AF_FLEXSPI2 0x0
#define SPI_B0_06_AF_GPIO 0x5

#define SPI_B0_07_AF_FLEXSPI2 0x0
#define SPI_B0_07_AF_GPIO 0x5

#define SPI_B0_08_AF_FLEXSPI2 0x0
#define SPI_B0_08_AF_GPIO 0x5

#define SPI_B0_09_AF_FLEXSPI2 0x0
#define SPI_B0_09_AF_GPIO 0x5

#define SPI_B0_10_AF_FLEXSPI2 0x0
#define SPI_B0_10_AF_GPIO 0x5

#define SPI_B0_11_AF_FLEXSPI2 0x0
#define SPI_B0_11_AF_GPIO 0x5

#define SPI_B0_12_AF_FLEXSPI2 0x0
#define SPI_B0_12_AF_GPIO 0x5

#define SPI_B0_13_AF_GPIO 0x5

#define SPI_B1_00_AF_FLEXSPI2 0x0
#define SPI_B1_00_AF_GPIO 0x5

#define SPI_B1_01_AF_FLEXSPI2 0x0
#define SPI_B1_01_AF_GPIO 0x5

#define SPI_B1_02_AF_FLEXSPI2 0x0
#define SPI_B1_02_AF_GPIO 0x5

#define SPI_B1_03_AF_FLEXSPI2 0x0
#define SPI_B1_03_AF_GPIO 0x5

#define SPI_B1_04_AF_FLEXSPI2 0x0
#define SPI_B1_04_AF_GPIO 0x5

#define SPI_B1_05_AF_FLEXSPI2 0x0
#define SPI_B1_05_AF_GPIO 0x5

#define SPI_B1_06_AF_FLEXSPI2 0x0
#define SPI_B1_06_AF_GPIO 0x5

#define SPI_B1_07_AF_GPIO 0x5

#define WAKEUP_AF_GPIO 0x5
#define WAKEUP_AF_NMI 0x7

#define PMIC_ON_REQ_AF_SNVS 0x0
#define PMIC_ON_REQ_AF_GPIO 0x5

#define PMIC_STBY_REQ_AF_CCM 0x0
#define PMIC_STBY_REQ_AF_GPIO 0x5

extern const imxrt_pad_t imxrt_pad_EMC_00;
extern const imxrt_pad_t imxrt_pad_EMC_01;
extern const imxrt_pad_t imxrt_pad_EMC_02;
extern const imxrt_pad_t imxrt_pad_EMC_03;
extern const imxrt_pad_t imxrt_pad_EMC_04;
extern const imxrt_pad_t imxrt_pad_EMC_05;
extern const imxrt_pad_t imxrt_pad_EMC_06;
extern const imxrt_pad_t imxrt_pad_EMC_07;
extern const imxrt_pad_t imxrt_pad_EMC_08;
extern const imxrt_pad_t imxrt_pad_EMC_09;
extern const imxrt_pad_t imxrt_pad_EMC_10;
extern const imxrt_pad_t imxrt_pad_EMC_11;
extern const imxrt_pad_t imxrt_pad_EMC_12;
extern const imxrt_pad_t imxrt_pad_EMC_13;
extern const imxrt_pad_t imxrt_pad_EMC_14;
extern const imxrt_pad_t imxrt_pad_EMC_15;
extern const imxrt_pad_t imxrt_pad_EMC_16;
extern const imxrt_pad_t imxrt_pad_EMC_17;
extern const imxrt_pad_t imxrt_pad_EMC_18;
extern const imxrt_pad_t imxrt_pad_EMC_19;
extern const imxrt_pad_t imxrt_pad_EMC_20;
extern const imxrt_pad_t imxrt_pad_EMC_21;
extern const imxrt_pad_t imxrt_pad_EMC_22;
extern const imxrt_pad_t imxrt_pad_EMC_23;
extern const imxrt_pad_t imxrt_pad_EMC_24;
extern const imxrt_pad_t imxrt_pad_EMC_25;
extern const imxrt_pad_t imxrt_pad_EMC_26;
extern const imxrt_pad_t imxrt_pad_EMC_27;
extern const imxrt_pad_t imxrt_pad_EMC_28;
extern const imxrt_pad_t imxrt_pad_EMC_29;
extern const imxrt_pad_t imxrt_pad_EMC_30;
extern const imxrt_pad_t imxrt_pad_EMC_31;
extern const imxrt_pad_t imxrt_pad_EMC_32;
extern const imxrt_pad_t imxrt_pad_EMC_33;
extern const imxrt_pad_t imxrt_pad_EMC_34;
extern const imxrt_pad_t imxrt_pad_EMC_35;
extern const imxrt_pad_t imxrt_pad_EMC_36;
extern const imxrt_pad_t imxrt_pad_EMC_37;
extern const imxrt_pad_t imxrt_pad_EMC_38;
extern const imxrt_pad_t imxrt_pad_EMC_39;
extern const imxrt_pad_t imxrt_pad_EMC_40;
extern const imxrt_pad_t imxrt_pad_EMC_41;
extern const imxrt_pad_t imxrt_pad_AD_B0_00;
extern const imxrt_pad_t imxrt_pad_AD_B0_01;
extern const imxrt_pad_t imxrt_pad_AD_B0_02;
extern const imxrt_pad_t imxrt_pad_AD_B0_03;
extern const imxrt_pad_t imxrt_pad_AD_B0_04;
extern const imxrt_pad_t imxrt_pad_AD_B0_05;
extern const imxrt_pad_t imxrt_pad_AD_B0_06;
extern const imxrt_pad_t imxrt_pad_AD_B0_07;
extern const imxrt_pad_t imxrt_pad_AD_B0_08;
extern const imxrt_pad_t imxrt_pad_AD_B0_09;
extern const imxrt_pad_t imxrt_pad_AD_B0_10;
extern const imxrt_pad_t imxrt_pad_AD_B0_11;
extern const imxrt_pad_t imxrt_pad_AD_B0_12;
extern const imxrt_pad_t imxrt_pad_AD_B0_13;
extern const imxrt_pad_t imxrt_pad_AD_B0_14;
extern const imxrt_pad_t imxrt_pad_AD_B0_15;
extern const imxrt_pad_t imxrt_pad_AD_B1_00;
extern const imxrt_pad_t imxrt_pad_AD_B1_01;
extern const imxrt_pad_t imxrt_pad_AD_B1_02;
extern const imxrt_pad_t imxrt_pad_AD_B1_03;
extern const imxrt_pad_t imxrt_pad_AD_B1_04;
extern const imxrt_pad_t imxrt_pad_AD_B1_05;
extern const imxrt_pad_t imxrt_pad_AD_B1_06;
extern const imxrt_pad_t imxrt_pad_AD_B1_07;
extern const imxrt_pad_t imxrt_pad_AD_B1_08;
extern const imxrt_pad_t imxrt_pad_AD_B1_09;
extern const imxrt_pad_t imxrt_pad_AD_B1_10;
extern const imxrt_pad_t imxrt_pad_AD_B1_11;
extern const imxrt_pad_t imxrt_pad_AD_B1_12;
extern const imxrt_pad_t imxrt_pad_AD_B1_13;
extern const imxrt_pad_t imxrt_pad_AD_B1_14;
extern const imxrt_pad_t imxrt_pad_AD_B1_15;
extern const imxrt_pad_t imxrt_pad_B0_00;
extern const imxrt_pad_t imxrt_pad_B0_01;
extern const imxrt_pad_t imxrt_pad_B0_02;
extern const imxrt_pad_t imxrt_pad_B0_03;
extern const imxrt_pad_t imxrt_pad_B0_04;
extern const imxrt_pad_t imxrt_pad_B0_05;
extern const imxrt_pad_t imxrt_pad_B0_06;
extern const imxrt_pad_t imxrt_pad_B0_07;
extern const imxrt_pad_t imxrt_pad_B0_08;
extern const imxrt_pad_t imxrt_pad_B0_09;
extern const imxrt_pad_t imxrt_pad_B0_10;
extern const imxrt_pad_t imxrt_pad_B0_11;
extern const imxrt_pad_t imxrt_pad_B0_12;
extern const imxrt_pad_t imxrt_pad_B0_13;
extern const imxrt_pad_t imxrt_pad_B0_14;
extern const imxrt_pad_t imxrt_pad_B0_15;
extern const imxrt_pad_t imxrt_pad_B1_00;
extern const imxrt_pad_t imxrt_pad_B1_01;
extern const imxrt_pad_t imxrt_pad_B1_02;
extern const imxrt_pad_t imxrt_pad_B1_03;
extern const imxrt_pad_t imxrt_pad_B1_04;
extern const imxrt_pad_t imxrt_pad_B1_05;
extern const imxrt_pad_t imxrt_pad_B1_06;
extern const imxrt_pad_t imxrt_pad_B1_07;
extern const imxrt_pad_t imxrt_pad_B1_08;
extern const imxrt_pad_t imxrt_pad_B1_09;
extern const imxrt_pad_t imxrt_pad_B1_10;
extern const imxrt_pad_t imxrt_pad_B1_11;
extern const imxrt_pad_t imxrt_pad_B1_12;
extern const imxrt_pad_t imxrt_pad_B1_13;
extern const imxrt_pad_t imxrt_pad_B1_14;
extern const imxrt_pad_t imxrt_pad_B1_15;
extern const imxrt_pad_t imxrt_pad_SD_B0_00;
extern const imxrt_pad_t imxrt_pad_SD_B0_01;
extern const imxrt_pad_t imxrt_pad_SD_B0_02;
extern const imxrt_pad_t imxrt_pad_SD_B0_03;
extern const imxrt_pad_t imxrt_pad_SD_B0_04;
extern const imxrt_pad_t imxrt_pad_SD_B0_05;
extern const imxrt_pad_t imxrt_pad_SD_B1_00;
extern const imxrt_pad_t imxrt_pad_SD_B1_01;
extern const imxrt_pad_t imxrt_pad_SD_B1_02;
extern const imxrt_pad_t imxrt_pad_SD_B1_03;
extern const imxrt_pad_t imxrt_pad_SD_B1_04;
extern const imxrt_pad_t imxrt_pad_SD_B1_05;
extern const imxrt_pad_t imxrt_pad_SD_B1_06;
extern const imxrt_pad_t imxrt_pad_SD_B1_07;
extern const imxrt_pad_t imxrt_pad_SD_B1_08;
extern const imxrt_pad_t imxrt_pad_SD_B1_09;
extern const imxrt_pad_t imxrt_pad_SD_B1_10;
extern const imxrt_pad_t imxrt_pad_SD_B1_11;
extern const imxrt_pad_t imxrt_pad_SPI_B0_00;
extern const imxrt_pad_t imxrt_pad_SPI_B0_01;
extern const imxrt_pad_t imxrt_pad_SPI_B0_02;
extern const imxrt_pad_t imxrt_pad_SPI_B0_03;
extern const imxrt_pad_t imxrt_pad_SPI_B0_04;
extern const imxrt_pad_t imxrt_pad_SPI_B0_05;
extern const imxrt_pad_t imxrt_pad_SPI_B0_06;
extern const imxrt_pad_t imxrt_pad_SPI_B0_07;
extern const imxrt_pad_t imxrt_pad_SPI_B0_08;
extern const imxrt_pad_t imxrt_pad_SPI_B0_09;
extern const imxrt_pad_t imxrt_pad_SPI_B0_10;
extern const imxrt_pad_t imxrt_pad_SPI_B0_11;
extern const imxrt_pad_t imxrt_pad_SPI_B0_12;
extern const imxrt_pad_t imxrt_pad_SPI_B0_13;
extern const imxrt_pad_t imxrt_pad_SPI_B1_00;
extern const imxrt_pad_t imxrt_pad_SPI_B1_01;
extern const imxrt_pad_t imxrt_pad_SPI_B1_02;
extern const imxrt_pad_t imxrt_pad_SPI_B1_03;
extern const imxrt_pad_t imxrt_pad_SPI_B1_04;
extern const imxrt_pad_t imxrt_pad_SPI_B1_05;
extern const imxrt_pad_t imxrt_pad_SPI_B1_06;
extern const imxrt_pad_t imxrt_pad_SPI_B1_07;
extern const imxrt_pad_t imxrt_pad_WAKEUP;
extern const imxrt_pad_t imxrt_pad_PMIC_ON_REQ;
extern const imxrt_pad_t imxrt_pad_PMIC_STBY_REQ;
#endif // __IMXRT_PADS_H__
